#pragma once
#include "MyInclude.h"

/*Задание 1. Вычисление корней квадратного уравнения
Требуется реализовать функцию вычисления корней квадратного
уравнения.
• Функция должна возвращать значение 1, если корни найдены,
значение нуля, если оба корня совпадают, и значение -1,
если корней не существует.
• Значения корней уравнений должны возвращаться в качестве
аргументов функции, передаваемых по ссылке.
Прототип функции должен выглядеть следующим образом:
int Myroot(double, double, double, double&, double&);*/


void MainSquareRoot() {


}
