#include "MyInclude.h"

/*Контрольные задания
Задание 1. Организация хранения данных в контейнере
Требуется написать программу, которая позволит присваивать
оценки студентам, указывая только имя студента.
Для организации данных используйте контейнер map 
(контейнер map – это класс, в котором все элементы хранятся
в виде пары ключ-значение), ключ должен быть уникальным 
и использоваться для доступа к связанной паре: 
имя студента – ключ, оценка (тип char) - значение.
Указание. Создайте структуру (класс в принципе
не требуется для этой задачи) StudentGrade 
с двумя элементами: имя студента (std::string) 
и оценка (char).*/


int main()
{
 
}
