#pragma once

/*Задание 1. Структура Time
Создайте структуру с именем Time. Три ее поля, имеющие
тип int, назовите hours, minutes и seconds. Напишите программу,
которая просит пользователя ввести время в формате часы, минуты,
секунды. Можно запрашивать на ввод как три значения сразу,
так и выводить для каждой величины отдельное приглашение.
Программа должна хранить время в структурной переменной
типа Time и выводить количество секунд во введенном времени.
Добавьте в структуру две функции для сложения и
вычитания интервалов времени.
При решении задачи учитывайте естественные допустимые
значения для реализуемых характеристик.*/

struct Time {

};