#pragma once
#include "MyInclude.h"

/*Задание 3. Решение квадратного уравнения
Чтобы вернуть из функции несколько результатов
без реализации нового типа (класса или структуры),
можно объединить их в кортеж. 
Кортеж tuple (из заголовочного файла <tuple>) допускает
наличие элементов различных типов и количество объектов
в кортеже должно быть известно во время компиляции.
Реализуйте решение квадратного уравнения с помощью функции, 
возвращающей переменную типа кортеж, содержащую 
решение этого уравнения (корни уравнения) и флаг, 
показывающий наличие корней.*/


void MainTupleSqrtRoot() {

}