#pragma once
#include "MyInclude.h"

/*Задание 3. Работа с различными треугольниками
Требуется написать программу, рассчитывающее площадь треугольников
двух типов: равностороннего и разностороннего.
Для решения задачи реализуйте перегруженные функции: первая должна
принимать один параметр – сторону и вычислять площадь равностороннего
23
треугольника, вторая – принимать три параметра-стороны треугольника
для вычисления площади разностороннего треугольника.
Выбор типа треугольника реализуйте с помощью диалога с пользователем.*/


void TriangleTest() {

}