#pragma once

/*«адание 1.  ласс Time
—оздайте класс с именем Time, содержащий три пол€
типа int, предназначенные дл€ хранени€ часов, минут и секунд.
ќдин из конструкторов класса должен инициализировать
пол€ нулевыми значени€ми, а другой конструктор
Ч заданным набором значений.
¬ конструктор с параметрами добавьте реализацию
приведени€ больших неправильных значений параметров
к правильным значени€м, например, если клиент захочет
создать врем€ с параметром минут равным 70, то конструктор 
должен преобразовать это значение к правильному виду:
количество часов и минут.
—оздайте метод класса, который будет выводить значени€
полей на экран в формате 11:59:59, и метод, складывающий 
значени€ двух объектов типа Time, передаваемых в качестве аргументов.
√де это возможно и оправдано, сделайте методы константными.
¬ функции main() следует создать два инициализированных 
объекта (подумайте, должны ли они быть константными) и один
неинициализированный объект. «атем сложите два инициализированных
значени€, а результат присвойте третьему объекту 
и выведите его значение на экран.*/

class Time {

};